```terraform
[command]/home/runner/work/_temp/180a9205-7cad-4a27-b301-34fdc35548c7/terraform-bin plan -no-color
module.iam.aws_iam_role.lambda_role[0]: Refreshing state... [id=lambda_role]
module.website_staging.aws_s3_bucket.www: Refreshing state... [id=www.staging.matchyaa.com]
data.aws_region.current: Reading...
module.website_production.aws_s3_bucket.www: Refreshing state... [id=www.matchyaa.com]
module.vpc.data.aws_vpc.default: Reading...
module.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=bastion_key_pair]
module.vpc.aws_security_group.rds_insecure[0]: Refreshing state... [id=sg-0fe5ac0862b0de626]
module.website_staging.aws_s3_bucket.main: Refreshing state... [id=staging.matchyaa.com]
module.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-01c5f678c56d122c2]
module.vpc.aws_security_group.rds_secure[0]: Refreshing state... [id=sg-0a1db631334cbf269]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.website_production.aws_s3_bucket.main: Refreshing state... [id=matchyaa.com]
module.website_production.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1VF96Y3XOOCS8]
module.website_staging.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E19C1SI7DD1NG1]
aws_route53_zone.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4]
module.iam.aws_iam_role_policy_attachment.dynamodb_full_access[0]: Refreshing state... [id=lambda_role-20231124000223603400000002]
module.iam.aws_ssm_parameter.lambda_role_arn[0]: Refreshing state... [id=/terraform/shared/iam/lambda_role_arn]
module.iam.aws_iam_role_policy_attachment.lambda_execute_policy[0]: Refreshing state... [id=lambda_role-20231124000223464500000001]
module.website_production.aws_s3_bucket_website_configuration.main: Refreshing state... [id=matchyaa.com]
module.website_production.aws_s3_bucket_public_access_block.main: Refreshing state... [id=matchyaa.com]
module.website_production.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.matchyaa.com]
module.website_production.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.matchyaa.com]
module.website_production.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/78ab2cbd-e386-45bb-a694-cc8b7261d899]
module.website_staging.aws_s3_bucket_public_access_block.main: Refreshing state... [id=staging.matchyaa.com]
module.website_staging.aws_s3_bucket_website_configuration.main: Refreshing state... [id=staging.matchyaa.com]
module.website_staging.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.staging.matchyaa.com]
module.website_staging.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.staging.matchyaa.com]
module.website_staging.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/ac92e100-24ac-45d7-bf0b-ecd5ca801a11]
module.website_production.aws_s3_bucket_policy.www: Refreshing state... [id=www.matchyaa.com]
module.website_staging.aws_s3_bucket_policy.www: Refreshing state... [id=www.staging.matchyaa.com]
module.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]
module.vpc.aws_security_group.rds[0]: Refreshing state... [id=sg-0aee8787a289bfd4d]
module.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-0f27534c3a493385e]
module.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-018110fcdfaa13ea2]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0b125ac6bcadc205a]
module.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-06383153ba9f3fde3]
module.vpc.aws_security_group.rds_postgres[0]: Refreshing state... [id=sg-0fd6a398ff6eaa706]
module.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0e6363cd41b9abd3a]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0925d82ab68baa24b]
module.vpc.aws_security_group.lambda[0]: Refreshing state... [id=sg-04c9eca5165fd1da2]
module.vpc.aws_security_group.ec2_public[0]: Refreshing state... [id=sg-0049f561f6149005e]
module.vpc.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-050b9b726eda89169]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0e0198390890d3e72]
module.vpc.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0e29c128d36d58cf5]
module.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-06493d019f8ab0b65]
module.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-06c393068f0474c7b]
module.vpc.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0cbed5ef2f9c98689]
module.vpc.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0dfab334830d5e8b7]
module.vpc.aws_vpc_endpoint.rds[0]: Refreshing state... [id=vpce-07e530d288be6af17]
module.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-06cca5ab192c57512]
module.ec2.aws_ssm_parameter.bastion_ip: Refreshing state... [id=/terraform/shared/bastion_host/elastic_ip]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform planned the following actions, but then encountered a problem:

  # module.ec2.aws_key_pair.bastion[0] must be replaced
-/+ resource "aws_key_pair" "bastion" {
      ~ arn             = "arn:aws:ec2:us-east-1:791901361445:key-pair/bastion_key_pair" -> (known after apply)
      ~ fingerprint     = "d0:d5:91:cf:08:d6:36:8b:cb:d7:9b:c7:43:7a:50:9f" -> (known after apply)
      ~ id              = "bastion_key_pair" -> (known after apply)
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-067d2fd6f85f536b3" -> (known after apply)
      ~ key_type        = "rsa" -> (known after apply)
      - public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDlzU90A3gvZ+TP5ydRDuJGBEzMcPtQyoO/3jmSXflXFEKbMzMWrRXJdaQxVT3anN6EGrrLc4B+P4sJw+nsk6YyBLYxEdjEGM7o2qqtnafB4vJBQyMkjMbE94JFsFoasuQ6e6F558VbkHjPKRx2D3Oo2ii3WwmRGyMDZ1OM97NELOEfQyhSir0FrTpx+Wsj019g7M030Tnt1lNVzEWgeVe0gJZ/v6PSsozW7DOLKHCEvUNcS54Z8+uS2Y+QSrHLVUeW5roP3IwawYP4ZOx9WWhI/lmB19TIGrV1GuidDm+AOwouOcy/O51UxISfd5nThH//5eBPvFkzGhZagRmSmQs/sT2mGK53zyHxt5yjZ4CrllF0vr80UbaORPWmC331yrCyOMW2sngkvnZdkvjJM7Zw2XiS7HgUNSE4sfN470dUKNHgZmoDg3D2PV6DmeO/mjOP6IU8fBZlZvM01yku5cy9i+nqQq4g/w8csuB15C/rheYaucqSunKlUKTPj9q1avs= ken@KennoMBP.cg.shawcable.net" -> null # forces replacement
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_security_group.ec2_public[0] will be updated in-place
  ~ resource "aws_security_group" "ec2_public" {
        id                     = "sg-0049f561f6149005e"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "ec2-public"
        tags                   = {
            "Name" = "ec2-public"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_security_group.rds_insecure[0] will be destroyed
  # (because aws_security_group.rds_insecure is not in configuration)
  - resource "aws_security_group" "rds_insecure" {
      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-0fe5ac0862b0de626" -> null
      - description            = "Security group for RDS instance" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0fe5ac0862b0de626" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "rds-security-group-insecure" -> null
      - owner_id               = "791901361445" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "rds-insecure"
        } -> null
      - tags_all               = {
          - "Name" = "rds-insecure"
        } -> null
      - vpc_id                 = "vpc-02b04f5cc72d62471" -> null
    }

  # module.vpc.aws_security_group.rds_secure[0] will be destroyed
  # (because aws_security_group.rds_secure is not in configuration)
  - resource "aws_security_group" "rds_secure" {
      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-0a1db631334cbf269" -> null
      - description            = "Security group for RDS Postgres database" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0a1db631334cbf269" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "rds-security-group-secure" -> null
      - owner_id               = "791901361445" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "rds-secure"
        } -> null
      - tags_all               = {
          - "Name" = "rds-secure"
        } -> null
      - vpc_id                 = "vpc-01c5f678c56d122c2" -> null
    }

  # module.vpc.aws_vpc_endpoint.rds[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_vpc_endpoint" "rds" {
      - arn                   = "arn:aws:ec2:us-east-1:791901361445:vpc-endpoint/vpce-07e530d288be6af17" -> null
      - cidr_blocks           = [] -> null
      - dns_entry             = [
          - {
              - dns_name       = "vpce-07e530d288be6af17-dsl92u9w.rds.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-07e530d288be6af17-dsl92u9w-us-east-1a.rds.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-07e530d288be6af17-dsl92u9w-us-east-1b.rds.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "rds.us-east-1.amazonaws.com"
              - hosted_zone_id = "Z084176111B5J6B4R6SRV"
            },
          - {
              - dns_name       = "rds.us-east-1.api.aws"
              - hosted_zone_id = "Z09264561NCLB3APINX4U"
            },
        ] -> null
      - id                    = "vpce-07e530d288be6af17" -> null
      - ip_address_type       = "ipv4" -> null
      - network_interface_ids = [
          - "eni-00fb0212176d70812",
          - "eni-0ef934fa8ad320979",
        ] -> null
      - owner_id              = "791901361445" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled   = true -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-06493d019f8ab0b65",
        ] -> null
      - service_name          = "com.amazonaws.us-east-1.rds" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-018110fcdfaa13ea2",
          - "subnet-06383153ba9f3fde3",
        ] -> null
      - tags                  = {
          - "Name" = "rds"
        } -> null
      - tags_all              = {
          - "Name" = "rds"
        } -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-01c5f678c56d122c2" -> null

      - dns_options {
          - dns_record_ip_type                             = "ipv4" -> null
          - private_dns_only_for_inbound_resolver_endpoint = false -> null
        }
    }

  # module.website_production.aws_s3_bucket.www must be replaced
+/- resource "aws_s3_bucket" "www" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::www.matchyaa.com" -> (known after apply)
      ~ bucket                      = "www.matchyaa.com" -> "www." # forces replacement
      ~ bucket_domain_name          = "www.matchyaa.com.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "www.matchyaa.com.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "www.matchyaa.com" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::www.matchyaa.com/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "www.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "index.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.website_production.aws_s3_bucket_policy.www must be replaced
-/+ resource "aws_s3_bucket_policy" "www" {
      ~ bucket = "www.matchyaa.com" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "www.matchyaa.com" -> (known after apply)
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource  = [
                          - "arn:aws:s3:::www.matchyaa.com/*",
                          + "arn:aws:s3:::www./*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
    }

  # module.website_production.aws_s3_bucket_public_access_block.www must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "www" {
      ~ bucket                  = "www.matchyaa.com" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "www.matchyaa.com" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.website_production.aws_s3_bucket_website_configuration.main will be updated in-place
  ~ resource "aws_s3_bucket_website_configuration" "main" {
        id               = "matchyaa.com"
        # (3 unchanged attributes hidden)

      ~ redirect_all_requests_to {
          ~ host_name = "www.matchyaa.com" -> "www."
            # (1 unchanged attribute hidden)
        }
    }

  # module.website_production.aws_s3_bucket_website_configuration.www must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "www" {
      ~ bucket           = "www.matchyaa.com" # forces replacement -> (known after apply) # forces replacement
      ~ id               = "www.matchyaa.com" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "www.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # module.website_staging.aws_s3_bucket.www must be replaced
+/- resource "aws_s3_bucket" "www" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::www.staging.matchyaa.com" -> (known after apply)
      ~ bucket                      = "www.staging.matchyaa.com" -> "www." # forces replacement
      ~ bucket_domain_name          = "www.staging.matchyaa.com.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "www.staging.matchyaa.com.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "www.staging.matchyaa.com" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::www.staging.matchyaa.com/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "www.staging.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "index.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.website_staging.aws_s3_bucket_policy.www must be replaced
-/+ resource "aws_s3_bucket_policy" "www" {
      ~ bucket = "www.staging.matchyaa.com" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "www.staging.matchyaa.com" -> (known after apply)
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource  = [
                          - "arn:aws:s3:::www.staging.matchyaa.com/*",
                          + "arn:aws:s3:::www./*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
    }

  # module.website_staging.aws_s3_bucket_public_access_block.www must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "www" {
      ~ bucket                  = "www.staging.matchyaa.com" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "www.staging.matchyaa.com" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.website_staging.aws_s3_bucket_website_configuration.main will be updated in-place
  ~ resource "aws_s3_bucket_website_configuration" "main" {
        id               = "staging.matchyaa.com"
        # (3 unchanged attributes hidden)

      ~ redirect_all_requests_to {
          ~ host_name = "www.staging.matchyaa.com" -> "www."
            # (1 unchanged attribute hidden)
        }
    }

  # module.website_staging.aws_s3_bucket_website_configuration.www must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "www" {
      ~ bucket           = "www.staging.matchyaa.com" # forces replacement -> (known after apply) # forces replacement
      ~ id               = "www.staging.matchyaa.com" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "www.staging.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)

        # (2 unchanged blocks hidden)
    }

Plan: 9 to add, 3 to change, 12 to destroy.

Error: expected length of name to be in the range (1 - 1024), got 

  with aws_route53_zone.main,
  on main.tf line 37, in resource "aws_route53_zone" "main":
  37:   name         = var.domain_name["prod"]


Error: invalid value for subject_alternative_names.0 (cannot end with a period)

  with module.website_production.aws_acm_certificate.cert,
  on modules/website/acm.tf line 8, in resource "aws_acm_certificate" "cert":
   8:   subject_alternative_names = ["www.${var.domain_name}"]


Error: invalid value for subject_alternative_names.0 (cannot end with a period)

  with module.website_staging.aws_acm_certificate.cert,
  on modules/website/acm.tf line 8, in resource "aws_acm_certificate" "cert":
   8:   subject_alternative_names = ["www.${var.domain_name}"]

::debug::Terraform exited with code 1.
::debug::stdout: module.iam.aws_iam_role.lambda_role[0]: Refreshing state... [id=lambda_role]%0Amodule.website_staging.aws_s3_bucket.www: Refreshing state... [id=www.staging.matchyaa.com]%0Adata.aws_region.current: Reading...%0Amodule.website_production.aws_s3_bucket.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=bastion_key_pair]%0Amodule.vpc.aws_security_group.rds_insecure[0]: Refreshing state... [id=sg-0fe5ac0862b0de626]%0Amodule.website_staging.aws_s3_bucket.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-01c5f678c56d122c2]%0Amodule.vpc.aws_security_group.rds_secure[0]: Refreshing state... [id=sg-0a1db631334cbf269]%0Adata.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.website_production.aws_s3_bucket.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_production.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1VF96Y3XOOCS8]%0Amodule.website_staging.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E19C1SI7DD1NG1]%0Aaws_route53_zone.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4]%0Amodule.iam.aws_iam_role_policy_attachment.dynamodb_full_access[0]: Refreshing state... [id=lambda_role-20231124000223603400000002]%0Amodule.iam.aws_ssm_parameter.lambda_role_arn[0]: Refreshing state... [id=/terraform/shared/iam/lambda_role_arn]%0Amodule.iam.aws_iam_role_policy_attachment.lambda_execute_policy[0]: Refreshing state... [id=lambda_role-20231124000223464500000001]%0Amodule.website_production.aws_s3_bucket_website_configuration.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_production.aws_s3_bucket_public_access_block.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_production.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_production.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_production.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/78ab2cbd-e386-45bb-a694-cc8b7261d899]%0Amodule.website_staging.aws_s3_bucket_public_access_block.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_website_configuration.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_staging.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/ac92e100-24ac-45d7-bf0b-ecd5ca801a11]%0Amodule.website_production.aws_s3_bucket_policy.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_policy.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]%0Amodule.vpc.aws_security_group.rds[0]: Refreshing state... [id=sg-0aee8787a289bfd4d]%0Amodule.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-0f27534c3a493385e]%0Amodule.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-018110fcdfaa13ea2]%0Amodule.vpc.aws_route_table.private: Refreshing state... [id=rtb-0b125ac6bcadc205a]%0Amodule.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.aws_security_group.rds_postgres[0]: Refreshing state... [id=sg-0fd6a398ff6eaa706]%0Amodule.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0925d82ab68baa24b]%0Amodule.vpc.aws_security_group.lambda[0]: Refreshing state... [id=sg-04c9eca5165fd1da2]%0Amodule.vpc.aws_security_group.ec2_public[0]: Refreshing state... [id=sg-0049f561f6149005e]%0Amodule.vpc.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-050b9b726eda89169]%0Amodule.vpc.aws_route_table.public: Refreshing state... [id=rtb-0e0198390890d3e72]%0Amodule.vpc.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0e29c128d36d58cf5]%0Amodule.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-06493d019f8ab0b65]%0Amodule.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-06c393068f0474c7b]%0Amodule.vpc.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0cbed5ef2f9c98689]%0Amodule.vpc.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0dfab334830d5e8b7]%0Amodule.vpc.aws_vpc_endpoint.rds[0]: Refreshing state... [id=vpce-07e530d288be6af17]%0Amodule.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-06cca5ab192c57512]%0Amodule.ec2.aws_ssm_parameter.bastion_ip: Refreshing state... [id=/terraform/shared/bastion_host/elastic_ip]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A+/- create replacement and then destroy%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.ec2.aws_key_pair.bastion[0] must be replaced%0A-/+ resource "aws_key_pair" "bastion" {%0A      ~ arn             = "arn:aws:ec2:us-east-1:791901361445:key-pair/bastion_key_pair" -> (known after apply)%0A      ~ fingerprint     = "d0:d5:91:cf:08:d6:36:8b:cb:d7:9b:c7:43:7a:50:9f" -> (known after apply)%0A      ~ id              = "bastion_key_pair" -> (known after apply)%0A      + key_name_prefix = (known after apply)%0A      ~ key_pair_id     = "key-067d2fd6f85f536b3" -> (known after apply)%0A      ~ key_type        = "rsa" -> (known after apply)%0A      - public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDlzU90A3gvZ+TP5ydRDuJGBEzMcPtQyoO/3jmSXflXFEKbMzMWrRXJdaQxVT3anN6EGrrLc4B+P4sJw+nsk6YyBLYxEdjEGM7o2qqtnafB4vJBQyMkjMbE94JFsFoasuQ6e6F558VbkHjPKRx2D3Oo2ii3WwmRGyMDZ1OM97NELOEfQyhSir0FrTpx+Wsj019g7M030Tnt1lNVzEWgeVe0gJZ/v6PSsozW7DOLKHCEvUNcS54Z8+uS2Y+QSrHLVUeW5roP3IwawYP4ZOx9WWhI/lmB19TIGrV1GuidDm+AOwouOcy/O51UxISfd5nThH//5eBPvFkzGhZagRmSmQs/sT2mGK53zyHxt5yjZ4CrllF0vr80UbaORPWmC331yrCyOMW2sngkvnZdkvjJM7Zw2XiS7HgUNSE4sfN470dUKNHgZmoDg3D2PV6DmeO/mjOP6IU8fBZlZvM01yku5cy9i+nqQq4g/w8csuB15C/rheYaucqSunKlUKTPj9q1avs= ken@KennoMBP.cg.shawcable.net" -> null # forces replacement%0A      - tags            = {} -> null%0A      ~ tags_all        = {} -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.vpc.aws_security_group.ec2_public[0] will be updated in-place%0A  ~ resource "aws_security_group" "ec2_public" {%0A        id                     = "sg-0049f561f6149005e"%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A        name                   = "ec2-public"%0A        tags                   = {%0A            "Name" = "ec2-public"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_security_group.rds_insecure[0] will be destroyed%0A  # (because aws_security_group.rds_insecure is not in configuration)%0A  - resource "aws_security_group" "rds_insecure" {%0A      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-0fe5ac0862b0de626" -> null%0A      - description            = "Security group for RDS instance" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0fe5ac0862b0de626" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A        ] -> null%0A      - name                   = "rds-security-group-insecure" -> null%0A      - owner_id               = "791901361445" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "Name" = "rds-insecure"%0A        } -> null%0A      - tags_all               = {%0A          - "Name" = "rds-insecure"%0A        } -> null%0A      - vpc_id                 = "vpc-02b04f5cc72d62471" -> null%0A    }%0A%0A  # module.vpc.aws_security_group.rds_secure[0] will be destroyed%0A  # (because aws_security_group.rds_secure is not in configuration)%0A  - resource "aws_security_group" "rds_secure" {%0A      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-0a1db631334cbf269" -> null%0A      - description            = "Security group for RDS Postgres database" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0a1db631334cbf269" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A        ] -> null%0A      - name                   = "rds-security-group-secure" -> null%0A      - owner_id               = "791901361445" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "Name" = "rds-secure"%0A        } -> null%0A      - tags_all               = {%0A          - "Name" = "rds-secure"%0A        } -> null%0A      - vpc_id                 = "vpc-01c5f678c56d122c2" -> null%0A    }%0A%0A  # module.vpc.aws_vpc_endpoint.rds[0] will be destroyed%0A  # (because index [0] is out of range for count)%0A  - resource "aws_vpc_endpoint" "rds" {%0A      - arn                   = "arn:aws:ec2:us-east-1:791901361445:vpc-endpoint/vpce-07e530d288be6af17" -> null%0A      - cidr_blocks           = [] -> null%0A      - dns_entry             = [%0A          - {%0A              - dns_name       = "vpce-07e530d288be6af17-dsl92u9w.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "vpce-07e530d288be6af17-dsl92u9w-us-east-1a.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "vpce-07e530d288be6af17-dsl92u9w-us-east-1b.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "rds.us-east-1.amazonaws.com"%0A              - hosted_zone_id = "Z084176111B5J6B4R6SRV"%0A            },%0A          - {%0A              - dns_name       = "rds.us-east-1.api.aws"%0A              - hosted_zone_id = "Z09264561NCLB3APINX4U"%0A            },%0A        ] -> null%0A      - id                    = "vpce-07e530d288be6af17" -> null%0A      - ip_address_type       = "ipv4" -> null%0A      - network_interface_ids = [%0A          - "eni-00fb0212176d70812",%0A          - "eni-0ef934fa8ad320979",%0A        ] -> null%0A      - owner_id              = "791901361445" -> null%0A      - policy                = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "*"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "*"%0A                    },%0A                ]%0A            }%0A        ) -> null%0A      - private_dns_enabled   = true -> null%0A      - requester_managed     = false -> null%0A      - route_table_ids       = [] -> null%0A      - security_group_ids    = [%0A          - "sg-06493d019f8ab0b65",%0A        ] -> null%0A      - service_name          = "com.amazonaws.us-east-1.rds" -> null%0A      - state                 = "available" -> null%0A      - subnet_ids            = [%0A          - "subnet-018110fcdfaa13ea2",%0A          - "subnet-06383153ba9f3fde3",%0A        ] -> null%0A      - tags                  = {%0A          - "Name" = "rds"%0A        } -> null%0A      - tags_all              = {%0A          - "Name" = "rds"%0A        } -> null%0A      - vpc_endpoint_type     = "Interface" -> null%0A      - vpc_id                = "vpc-01c5f678c56d122c2" -> null%0A%0A      - dns_options {%0A          - dns_record_ip_type                             = "ipv4" -> null%0A          - private_dns_only_for_inbound_resolver_endpoint = false -> null%0A        }%0A    }%0A%0A  # module.website_production.aws_s3_bucket.www must be replaced%0A+/- resource "aws_s3_bucket" "www" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      ~ arn                         = "arn:aws:s3:::www.matchyaa.com" -> (known after apply)%0A      ~ bucket                      = "www.matchyaa.com" -> "www." # forces replacement%0A      ~ bucket_domain_name          = "www.matchyaa.com.s3.amazonaws.com" -> (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      ~ bucket_regional_domain_name = "www.matchyaa.com.s3.us-east-1.amazonaws.com" -> (known after apply)%0A      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)%0A      ~ id                          = "www.matchyaa.com" -> (known after apply)%0A      ~ object_lock_enabled         = false -> (known after apply)%0A      ~ policy                      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "s3:GetObject"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "arn:aws:s3:::www.matchyaa.com/*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A      ~ region                      = "us-east-1" -> (known after apply)%0A      ~ request_payer               = "BucketOwner" -> (known after apply)%0A      - tags                        = {} -> null%0A      ~ tags_all                    = {} -> (known after apply)%0A      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint            = "www.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A%0A      - grant {%0A          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = false -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - sse_algorithm = "AES256" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = false -> null%0A          - mfa_delete = false -> null%0A        }%0A%0A      - website {%0A          - error_document = "index.html" -> null%0A          - index_document = "index.html" -> null%0A        }%0A    }%0A%0A  # module.website_production.aws_s3_bucket_policy.www must be replaced%0A-/+ resource "aws_s3_bucket_policy" "www" {%0A      ~ bucket = "www.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id     = "www.matchyaa.com" -> (known after apply)%0A      ~ policy = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Resource  = [%0A                          - "arn:aws:s3:::www.matchyaa.com/*",%0A                          + "arn:aws:s3:::www./*",%0A                        ]%0A                        # (3 unchanged attributes hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A    }%0A%0A  # module.website_production.aws_s3_bucket_public_access_block.www must be replaced%0A-/+ resource "aws_s3_bucket_public_access_block" "www" {%0A      ~ bucket                  = "www.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                      = "www.matchyaa.com" -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.website_production.aws_s3_bucket_website_configuration.main will be updated in-place%0A  ~ resource "aws_s3_bucket_website_configuration" "main" {%0A        id               = "matchyaa.com"%0A        # (3 unchanged attributes hidden)%0A%0A      ~ redirect_all_requests_to {%0A          ~ host_name = "www.matchyaa.com" -> "www."%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.website_production.aws_s3_bucket_website_configuration.www must be replaced%0A-/+ resource "aws_s3_bucket_website_configuration" "www" {%0A      ~ bucket           = "www.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id               = "www.matchyaa.com" -> (known after apply)%0A      + routing_rules    = (known after apply)%0A      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint = "www.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.website_staging.aws_s3_bucket.www must be replaced%0A+/- resource "aws_s3_bucket" "www" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      ~ arn                         = "arn:aws:s3:::www.staging.matchyaa.com" -> (known after apply)%0A      ~ bucket                      = "www.staging.matchyaa.com" -> "www." # forces replacement%0A      ~ bucket_domain_name          = "www.staging.matchyaa.com.s3.amazonaws.com" -> (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      ~ bucket_regional_domain_name = "www.staging.matchyaa.com.s3.us-east-1.amazonaws.com" -> (known after apply)%0A      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)%0A      ~ id                          = "www.staging.matchyaa.com" -> (known after apply)%0A      ~ object_lock_enabled         = false -> (known after apply)%0A      ~ policy                      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "s3:GetObject"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "arn:aws:s3:::www.staging.matchyaa.com/*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A      ~ region                      = "us-east-1" -> (known after apply)%0A      ~ request_payer               = "BucketOwner" -> (known after apply)%0A      - tags                        = {} -> null%0A      ~ tags_all                    = {} -> (known after apply)%0A      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint            = "www.staging.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A%0A      - grant {%0A          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = false -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - sse_algorithm = "AES256" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = false -> null%0A          - mfa_delete = false -> null%0A        }%0A%0A      - website {%0A          - error_document = "index.html" -> null%0A          - index_document = "index.html" -> null%0A        }%0A    }%0A%0A  # module.website_staging.aws_s3_bucket_policy.www must be replaced%0A-/+ resource "aws_s3_bucket_policy" "www" {%0A      ~ bucket = "www.staging.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id     = "www.staging.matchyaa.com" -> (known after apply)%0A      ~ policy = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Resource  = [%0A                          - "arn:aws:s3:::www.staging.matchyaa.com/*",%0A                          + "arn:aws:s3:::www./*",%0A                        ]%0A                        # (3 unchanged attributes hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A    }%0A%0A  # module.website_staging.aws_s3_bucket_public_access_block.www must be replaced%0A-/+ resource "aws_s3_bucket_public_access_block" "www" {%0A      ~ bucket                  = "www.staging.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                      = "www.staging.matchyaa.com" -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.website_staging.aws_s3_bucket_website_configuration.main will be updated in-place%0A  ~ resource "aws_s3_bucket_website_configuration" "main" {%0A        id               = "staging.matchyaa.com"%0A        # (3 unchanged attributes hidden)%0A%0A      ~ redirect_all_requests_to {%0A          ~ host_name = "www.staging.matchyaa.com" -> "www."%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.website_staging.aws_s3_bucket_website_configuration.www must be replaced%0A-/+ resource "aws_s3_bucket_website_configuration" "www" {%0A      ~ bucket           = "www.staging.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id               = "www.staging.matchyaa.com" -> (known after apply)%0A      + routing_rules    = (known after apply)%0A      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint = "www.staging.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0APlan: 9 to add, 3 to change, 12 to destroy.%0A
::debug::stderr: %0AError: expected length of name to be in the range (1 - 1024), got %0A%0A  with aws_route53_zone.main,%0A  on main.tf line 37, in resource "aws_route53_zone" "main":%0A  37:   name         = var.domain_name["prod"]%0A%0A%0AError: invalid value for subject_alternative_names.0 (cannot end with a period)%0A%0A  with module.website_production.aws_acm_certificate.cert,%0A  on modules/website/acm.tf line 8, in resource "aws_acm_certificate" "cert":%0A   8:   subject_alternative_names = ["www.${var.domain_name}"]%0A%0A%0AError: invalid value for subject_alternative_names.0 (cannot end with a period)%0A%0A  with module.website_staging.aws_acm_certificate.cert,%0A  on modules/website/acm.tf line 8, in resource "aws_acm_certificate" "cert":%0A   8:   subject_alternative_names = ["www.${var.domain_name}"]%0A%0A
::debug::exitcode: 1

::set-output name=stdout::module.iam.aws_iam_role.lambda_role[0]: Refreshing state... [id=lambda_role]%0Amodule.website_staging.aws_s3_bucket.www: Refreshing state... [id=www.staging.matchyaa.com]%0Adata.aws_region.current: Reading...%0Amodule.website_production.aws_s3_bucket.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=bastion_key_pair]%0Amodule.vpc.aws_security_group.rds_insecure[0]: Refreshing state... [id=sg-0fe5ac0862b0de626]%0Amodule.website_staging.aws_s3_bucket.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-01c5f678c56d122c2]%0Amodule.vpc.aws_security_group.rds_secure[0]: Refreshing state... [id=sg-0a1db631334cbf269]%0Adata.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.website_production.aws_s3_bucket.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_production.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1VF96Y3XOOCS8]%0Amodule.website_staging.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E19C1SI7DD1NG1]%0Aaws_route53_zone.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4]%0Amodule.iam.aws_iam_role_policy_attachment.dynamodb_full_access[0]: Refreshing state... [id=lambda_role-20231124000223603400000002]%0Amodule.iam.aws_ssm_parameter.lambda_role_arn[0]: Refreshing state... [id=/terraform/shared/iam/lambda_role_arn]%0Amodule.iam.aws_iam_role_policy_attachment.lambda_execute_policy[0]: Refreshing state... [id=lambda_role-20231124000223464500000001]%0Amodule.website_production.aws_s3_bucket_website_configuration.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_production.aws_s3_bucket_public_access_block.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_production.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_production.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_production.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/78ab2cbd-e386-45bb-a694-cc8b7261d899]%0Amodule.website_staging.aws_s3_bucket_public_access_block.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_website_configuration.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_staging.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/ac92e100-24ac-45d7-bf0b-ecd5ca801a11]%0Amodule.website_production.aws_s3_bucket_policy.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_policy.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]%0Amodule.vpc.aws_security_group.rds[0]: Refreshing state... [id=sg-0aee8787a289bfd4d]%0Amodule.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-0f27534c3a493385e]%0Amodule.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-018110fcdfaa13ea2]%0Amodule.vpc.aws_route_table.private: Refreshing state... [id=rtb-0b125ac6bcadc205a]%0Amodule.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.aws_security_group.rds_postgres[0]: Refreshing state... [id=sg-0fd6a398ff6eaa706]%0Amodule.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0925d82ab68baa24b]%0Amodule.vpc.aws_security_group.lambda[0]: Refreshing state... [id=sg-04c9eca5165fd1da2]%0Amodule.vpc.aws_security_group.ec2_public[0]: Refreshing state... [id=sg-0049f561f6149005e]%0Amodule.vpc.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-050b9b726eda89169]%0Amodule.vpc.aws_route_table.public: Refreshing state... [id=rtb-0e0198390890d3e72]%0Amodule.vpc.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0e29c128d36d58cf5]%0Amodule.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-06493d019f8ab0b65]%0Amodule.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-06c393068f0474c7b]%0Amodule.vpc.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0cbed5ef2f9c98689]%0Amodule.vpc.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0dfab334830d5e8b7]%0Amodule.vpc.aws_vpc_endpoint.rds[0]: Refreshing state... [id=vpce-07e530d288be6af17]%0Amodule.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-06cca5ab192c57512]%0Amodule.ec2.aws_ssm_parameter.bastion_ip: Refreshing state... [id=/terraform/shared/bastion_host/elastic_ip]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A+/- create replacement and then destroy%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.ec2.aws_key_pair.bastion[0] must be replaced%0A-/+ resource "aws_key_pair" "bastion" {%0A      ~ arn             = "arn:aws:ec2:us-east-1:791901361445:key-pair/bastion_key_pair" -> (known after apply)%0A      ~ fingerprint     = "d0:d5:91:cf:08:d6:36:8b:cb:d7:9b:c7:43:7a:50:9f" -> (known after apply)%0A      ~ id              = "bastion_key_pair" -> (known after apply)%0A      + key_name_prefix = (known after apply)%0A      ~ key_pair_id     = "key-067d2fd6f85f536b3" -> (known after apply)%0A      ~ key_type        = "rsa" -> (known after apply)%0A      - public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDlzU90A3gvZ+TP5ydRDuJGBEzMcPtQyoO/3jmSXflXFEKbMzMWrRXJdaQxVT3anN6EGrrLc4B+P4sJw+nsk6YyBLYxEdjEGM7o2qqtnafB4vJBQyMkjMbE94JFsFoasuQ6e6F558VbkHjPKRx2D3Oo2ii3WwmRGyMDZ1OM97NELOEfQyhSir0FrTpx+Wsj019g7M030Tnt1lNVzEWgeVe0gJZ/v6PSsozW7DOLKHCEvUNcS54Z8+uS2Y+QSrHLVUeW5roP3IwawYP4ZOx9WWhI/lmB19TIGrV1GuidDm+AOwouOcy/O51UxISfd5nThH//5eBPvFkzGhZagRmSmQs/sT2mGK53zyHxt5yjZ4CrllF0vr80UbaORPWmC331yrCyOMW2sngkvnZdkvjJM7Zw2XiS7HgUNSE4sfN470dUKNHgZmoDg3D2PV6DmeO/mjOP6IU8fBZlZvM01yku5cy9i+nqQq4g/w8csuB15C/rheYaucqSunKlUKTPj9q1avs= ken@KennoMBP.cg.shawcable.net" -> null # forces replacement%0A      - tags            = {} -> null%0A      ~ tags_all        = {} -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.vpc.aws_security_group.ec2_public[0] will be updated in-place%0A  ~ resource "aws_security_group" "ec2_public" {%0A        id                     = "sg-0049f561f6149005e"%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A        name                   = "ec2-public"%0A        tags                   = {%0A            "Name" = "ec2-public"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_security_group.rds_insecure[0] will be destroyed%0A  # (because aws_security_group.rds_insecure is not in configuration)%0A  - resource "aws_security_group" "rds_insecure" {%0A      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-0fe5ac0862b0de626" -> null%0A      - description            = "Security group for RDS instance" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0fe5ac0862b0de626" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A        ] -> null%0A      - name                   = "rds-security-group-insecure" -> null%0A      - owner_id               = "791901361445" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "Name" = "rds-insecure"%0A        } -> null%0A      - tags_all               = {%0A          - "Name" = "rds-insecure"%0A        } -> null%0A      - vpc_id                 = "vpc-02b04f5cc72d62471" -> null%0A    }%0A%0A  # module.vpc.aws_security_group.rds_secure[0] will be destroyed%0A  # (because aws_security_group.rds_secure is not in configuration)%0A  - resource "aws_security_group" "rds_secure" {%0A      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-0a1db631334cbf269" -> null%0A      - description            = "Security group for RDS Postgres database" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0a1db631334cbf269" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A        ] -> null%0A      - name                   = "rds-security-group-secure" -> null%0A      - owner_id               = "791901361445" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "Name" = "rds-secure"%0A        } -> null%0A      - tags_all               = {%0A          - "Name" = "rds-secure"%0A        } -> null%0A      - vpc_id                 = "vpc-01c5f678c56d122c2" -> null%0A    }%0A%0A  # module.vpc.aws_vpc_endpoint.rds[0] will be destroyed%0A  # (because index [0] is out of range for count)%0A  - resource "aws_vpc_endpoint" "rds" {%0A      - arn                   = "arn:aws:ec2:us-east-1:791901361445:vpc-endpoint/vpce-07e530d288be6af17" -> null%0A      - cidr_blocks           = [] -> null%0A      - dns_entry             = [%0A          - {%0A              - dns_name       = "vpce-07e530d288be6af17-dsl92u9w.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "vpce-07e530d288be6af17-dsl92u9w-us-east-1a.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "vpce-07e530d288be6af17-dsl92u9w-us-east-1b.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "rds.us-east-1.amazonaws.com"%0A              - hosted_zone_id = "Z084176111B5J6B4R6SRV"%0A            },%0A          - {%0A              - dns_name       = "rds.us-east-1.api.aws"%0A              - hosted_zone_id = "Z09264561NCLB3APINX4U"%0A            },%0A        ] -> null%0A      - id                    = "vpce-07e530d288be6af17" -> null%0A      - ip_address_type       = "ipv4" -> null%0A      - network_interface_ids = [%0A          - "eni-00fb0212176d70812",%0A          - "eni-0ef934fa8ad320979",%0A        ] -> null%0A      - owner_id              = "791901361445" -> null%0A      - policy                = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "*"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "*"%0A                    },%0A                ]%0A            }%0A        ) -> null%0A      - private_dns_enabled   = true -> null%0A      - requester_managed     = false -> null%0A      - route_table_ids       = [] -> null%0A      - security_group_ids    = [%0A          - "sg-06493d019f8ab0b65",%0A        ] -> null%0A      - service_name          = "com.amazonaws.us-east-1.rds" -> null%0A      - state                 = "available" -> null%0A      - subnet_ids            = [%0A          - "subnet-018110fcdfaa13ea2",%0A          - "subnet-06383153ba9f3fde3",%0A        ] -> null%0A      - tags                  = {%0A          - "Name" = "rds"%0A        } -> null%0A      - tags_all              = {%0A          - "Name" = "rds"%0A        } -> null%0A      - vpc_endpoint_type     = "Interface" -> null%0A      - vpc_id                = "vpc-01c5f678c56d122c2" -> null%0A%0A      - dns_options {%0A          - dns_record_ip_type                             = "ipv4" -> null%0A          - private_dns_only_for_inbound_resolver_endpoint = false -> null%0A        }%0A    }%0A%0A  # module.website_production.aws_s3_bucket.www must be replaced%0A+/- resource "aws_s3_bucket" "www" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      ~ arn                         = "arn:aws:s3:::www.matchyaa.com" -> (known after apply)%0A      ~ bucket                      = "www.matchyaa.com" -> "www." # forces replacement%0A      ~ bucket_domain_name          = "www.matchyaa.com.s3.amazonaws.com" -> (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      ~ bucket_regional_domain_name = "www.matchyaa.com.s3.us-east-1.amazonaws.com" -> (known after apply)%0A      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)%0A      ~ id                          = "www.matchyaa.com" -> (known after apply)%0A      ~ object_lock_enabled         = false -> (known after apply)%0A      ~ policy                      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "s3:GetObject"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "arn:aws:s3:::www.matchyaa.com/*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A      ~ region                      = "us-east-1" -> (known after apply)%0A      ~ request_payer               = "BucketOwner" -> (known after apply)%0A      - tags                        = {} -> null%0A      ~ tags_all                    = {} -> (known after apply)%0A      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint            = "www.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A%0A      - grant {%0A          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = false -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - sse_algorithm = "AES256" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = false -> null%0A          - mfa_delete = false -> null%0A        }%0A%0A      - website {%0A          - error_document = "index.html" -> null%0A          - index_document = "index.html" -> null%0A        }%0A    }%0A%0A  # module.website_production.aws_s3_bucket_policy.www must be replaced%0A-/+ resource "aws_s3_bucket_policy" "www" {%0A      ~ bucket = "www.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id     = "www.matchyaa.com" -> (known after apply)%0A      ~ policy = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Resource  = [%0A                          - "arn:aws:s3:::www.matchyaa.com/*",%0A                          + "arn:aws:s3:::www./*",%0A                        ]%0A                        # (3 unchanged attributes hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A    }%0A%0A  # module.website_production.aws_s3_bucket_public_access_block.www must be replaced%0A-/+ resource "aws_s3_bucket_public_access_block" "www" {%0A      ~ bucket                  = "www.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                      = "www.matchyaa.com" -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.website_production.aws_s3_bucket_website_configuration.main will be updated in-place%0A  ~ resource "aws_s3_bucket_website_configuration" "main" {%0A        id               = "matchyaa.com"%0A        # (3 unchanged attributes hidden)%0A%0A      ~ redirect_all_requests_to {%0A          ~ host_name = "www.matchyaa.com" -> "www."%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.website_production.aws_s3_bucket_website_configuration.www must be replaced%0A-/+ resource "aws_s3_bucket_website_configuration" "www" {%0A      ~ bucket           = "www.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id               = "www.matchyaa.com" -> (known after apply)%0A      + routing_rules    = (known after apply)%0A      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint = "www.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.website_staging.aws_s3_bucket.www must be replaced%0A+/- resource "aws_s3_bucket" "www" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      ~ arn                         = "arn:aws:s3:::www.staging.matchyaa.com" -> (known after apply)%0A      ~ bucket                      = "www.staging.matchyaa.com" -> "www." # forces replacement%0A      ~ bucket_domain_name          = "www.staging.matchyaa.com.s3.amazonaws.com" -> (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      ~ bucket_regional_domain_name = "www.staging.matchyaa.com.s3.us-east-1.amazonaws.com" -> (known after apply)%0A      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)%0A      ~ id                          = "www.staging.matchyaa.com" -> (known after apply)%0A      ~ object_lock_enabled         = false -> (known after apply)%0A      ~ policy                      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "s3:GetObject"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "arn:aws:s3:::www.staging.matchyaa.com/*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A      ~ region                      = "us-east-1" -> (known after apply)%0A      ~ request_payer               = "BucketOwner" -> (known after apply)%0A      - tags                        = {} -> null%0A      ~ tags_all                    = {} -> (known after apply)%0A      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint            = "www.staging.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A%0A      - grant {%0A          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = false -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - sse_algorithm = "AES256" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = false -> null%0A          - mfa_delete = false -> null%0A        }%0A%0A      - website {%0A          - error_document = "index.html" -> null%0A          - index_document = "index.html" -> null%0A        }%0A    }%0A%0A  # module.website_staging.aws_s3_bucket_policy.www must be replaced%0A-/+ resource "aws_s3_bucket_policy" "www" {%0A      ~ bucket = "www.staging.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id     = "www.staging.matchyaa.com" -> (known after apply)%0A      ~ policy = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Resource  = [%0A                          - "arn:aws:s3:::www.staging.matchyaa.com/*",%0A                          + "arn:aws:s3:::www./*",%0A                        ]%0A                        # (3 unchanged attributes hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A    }%0A%0A  # module.website_staging.aws_s3_bucket_public_access_block.www must be replaced%0A-/+ resource "aws_s3_bucket_public_access_block" "www" {%0A      ~ bucket                  = "www.staging.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                      = "www.staging.matchyaa.com" -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.website_staging.aws_s3_bucket_website_configuration.main will be updated in-place%0A  ~ resource "aws_s3_bucket_website_configuration" "main" {%0A        id               = "staging.matchyaa.com"%0A        # (3 unchanged attributes hidden)%0A%0A      ~ redirect_all_requests_to {%0A          ~ host_name = "www.staging.matchyaa.com" -> "www."%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.website_staging.aws_s3_bucket_website_configuration.www must be replaced%0A-/+ resource "aws_s3_bucket_website_configuration" "www" {%0A      ~ bucket           = "www.staging.matchyaa.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ id               = "www.staging.matchyaa.com" -> (known after apply)%0A      + routing_rules    = (known after apply)%0A      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint = "www.staging.matchyaa.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0APlan: 9 to add, 3 to change, 12 to destroy.%0A

::set-output name=stderr::%0AError: expected length of name to be in the range (1 - 1024), got %0A%0A  with aws_route53_zone.main,%0A  on main.tf line 37, in resource "aws_route53_zone" "main":%0A  37:   name         = var.domain_name["prod"]%0A%0A%0AError: invalid value for subject_alternative_names.0 (cannot end with a period)%0A%0A  with module.website_production.aws_acm_certificate.cert,%0A  on modules/website/acm.tf line 8, in resource "aws_acm_certificate" "cert":%0A   8:   subject_alternative_names = ["www.${var.domain_name}"]%0A%0A%0AError: invalid value for subject_alternative_names.0 (cannot end with a period)%0A%0A  with module.website_staging.aws_acm_certificate.cert,%0A  on modules/website/acm.tf line 8, in resource "aws_acm_certificate" "cert":%0A   8:   subject_alternative_names = ["www.${var.domain_name}"]%0A%0A

::set-output name=exitcode::1
::error::Terraform exited with code 1.

```